app/views/albums/index.html.erb

        <td><%= album.title %></td>
        <td><%= album.songs.count%></td>
---
SELECT "songs".* FROM "songs" WHERE "songs"."album_id" = $1  [["album_id", 1]]
SELECT COUNT(*) FROM "songs" WHERE "songs"."album_id" = $1  [["album_id", 1]]