app/views/albums/show.html.erb

SELECT "songs".* FROM "songs" WHERE "songs"."album_id" = $1  [["album_id", 1]]
---
  <hr>
  <%@album.songs.each do|song| %>