app/controllers/admin_controller.rb

	def authorize
		admin = Admin.first
---
SELECT  "admins".* FROM "admins"  ORDER BY "admins"."id" ASC LIMIT 1