app/controllers/albums_controller.rb

  def create
    @album = Album.new(album_params)

    respond_to do |format|
      if @album.save
---
INSERT INTO "albums" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Album 1"], ["created_at", "2015-10-13 19:13:49.796577"], ["updated_at", "2015-10-13 19:13:49.796577"]]

  def update
    respond_to do |format|
      if @album.update(album_params)
---
UPDATE "albums" SET "title" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["title", "Cool Shit"], ["updated_at", "2015-10-13 22:24:40.109765"], ["id", 1]]