app/controllers/events_controller.rb

INSERT INTO "events" ("title", "body", "picture", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
	def create
    @event = Event.new(event_params)
      if @event.save