app/controllers/musics_controller.rb

  def index
    @musics = Music.all
---
SELECT "musics".* FROM "musics"

  def create
    @music = Music.new(music_params)
      if @music.save
---
INSERT INTO "musics" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2015-10-13 01:51:53.531245"], ["updated_at", "2015-10-13 01:51:53.531245"]]

  def destroy
    @music.destroy
---
DELETE FROM "musics" WHERE "musics"."id" = $1  [["id", 3]]

    def set_music
      @music = Music.find(params[:id])
---
SELECT  "musics".* FROM "musics" WHERE "musics"."id" = $1 LIMIT 1  [["id", 3]]