app/controllers/pictures_controller.rb

SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @picture = Picture.find_by(id: params[:id])

INSERT INTO "pictures" ("name", "url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", ""], ["url", ""], ["created_at", "2015-10-09 20:11:03.629038"], ["updated_at", "2015-10-09 20:11:03.629038"]]
SELECT  "albums".* FROM "albums"  ORDER BY "albums"."id" DESC LIMIT 1
UPDATE "pictures" SET "album_id" = $1, "updated_at" = $2 WHERE "pictures"."id" = $3  [["album_id", 22], ["updated_at", "2015-10-10 12:02:45.844704"], ["id", 47]]
---
  def create
    @picture = Picture.create(picture_params)
    @album = Album.all.last
    @picture.album_id = @album.id
    if @picture.save

DELETE FROM "pictures" WHERE "pictures"."id" = $1  [["id", 1]]
---
  def destroy
    if @picture.destroy