app/controllers/songs_controller.rb

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT 1  [["id", nil]]
---
  def new
    @song = Song.new
    @album = Album.find(params[:album_id])

INSERT INTO "songs" ("title", "lyric", "album_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "fdasfda"], ["lyric", "afdsa"], ["album_id", 1], ["created_at", "2015-10-13 21:26:24.100285"], ["updated_at", "2015-10-13 21:26:24.100285"]]
---
  def create

    @song = Song.new(song_params.merge(album_id: params[:song][:album_id]))
    respond_to do |format|
      if @song.save

UPDATE "songs" SET "lyric" = $1, "updated_at" = $2 WHERE "songs"."id" = $3  [["lyric", "sadafafsafafsdl;;alvnavnsdNVLKSLKV"], ["updated_at", "2015-10-13 22:17:32.422393"], ["id", 13]]
---
  def update
    respond_to do |format|
      if @song.update(song_params)