app/controllers/videos_controller.rb

INSERT INTO "videos" ("url", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["url", "https://www.youtube.com/embed/EDWP2vZpZIo"], ["name", "hahahaha"], ["created_at", "2015-10-10 05:52:14.313196"], ["updated_at", "2015-10-10 05:52:14.313196"]]
---
  def create
    @video = Video.new(video_params)
    @video.convert_to_embed_url
      if @video.save

DELETE FROM "videos" WHERE "videos"."id" = $1  [["id", 5]]
---
  def destroy
    @video.destroy